DND318/STM32-Lab/Question 5 STMide.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
int num = 0;
int16_t t;
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void display7SEGMENT(int num){
	if(num == 0) num =9;
	switch (num){
	case 0:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_SET);
			break;
	case 1:
				HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_SET);
				break;
	case 2:
				HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_RESET);
				break;
	case 3:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_RESET);
			break;
	case 4:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_RESET);
			break;
	case 5:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_RESET);
			break;
	case 6:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_RESET);
			break;
	case 7:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_SET);
			break;
	case 8:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_RESET);
			break;
	case 9:
			HAL_GPIO_WritePin(GPIOB, PB0_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB1_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB2_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB3_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB4_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOB, PB5_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOB, PB6_Pin, GPIO_PIN_RESET);
			break;

}}
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config1();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  if(t>=0 && t<3){
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_10, GPIO_PIN_RESET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_11, GPIO_PIN_RESET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_6, GPIO_PIN_SET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_12, GPIO_PIN_SET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_13, GPIO_PIN_SET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_8, GPIO_PIN_SET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_14, GPIO_PIN_SET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_9, GPIO_PIN_SET);
	  	  		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
	  	  	 }
	  	  	 if(t>=3 && t<5){
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_10, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_11, GPIO_PIN_RESET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_6, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_12, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_13, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_8, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_14, GPIO_PIN_SET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_9, GPIO_PIN_RESET);
	  	  	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_15, GPIO_PIN_RESET);
	  	  	 	 }
	  	  	 if(t>=5 && t<8){
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_10, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_11, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_6, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_12, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_13, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_8, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_14, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_9, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
	  	  	 	 	 }
	  	  	 if(t>=8 && t<10){
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_10, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_11, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_6, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_12, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_13, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_8, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_14, GPIO_PIN_RESET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_9, GPIO_PIN_SET);
	  	  	 	 		 HAL_GPIO_WritePin (GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
	  	  	 	 	 }
	  	  	 HAL_Delay(1000);
	  	  	 t = t+1;
	  	  	 if(t>=10) t = 0;
	  if(num == 0) num =10;
	  display7SEGMENT(num--);
	  HAL_Delay(1000);

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config1(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler1();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler1();
  }
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, PA4_Pin|PA5_Pin|PA6_Pin|PA7_Pin
                          |PA8_Pin|PA9_Pin|PA10_Pin|PA11_Pin
                          |PA12_Pin|PA13_Pin|PA14_Pin|PA15_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, PB0_Pin|PB1_Pin|PB2_Pin|PB3_Pin
                          |PB4_Pin|PB5_Pin|PB6_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : PA4_Pin PA5_Pin PA6_Pin PA7_Pin
                           PA8_Pin PA9_Pin PA10_Pin PA11_Pin
                           PA12_Pin PA13_Pin PA14_Pin PA15_Pin */
  GPIO_InitStruct.Pin = PA4_Pin|PA5_Pin|PA6_Pin|PA7_Pin
                          |PA8_Pin|PA9_Pin|PA10_Pin|PA11_Pin
                          |PA12_Pin|PA13_Pin|PA14_Pin|PA15_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PB0_Pin PB1_Pin PB2_Pin PB3_Pin
                           PB4_Pin PB5_Pin PB6_Pin */
  GPIO_InitStruct.Pin = PB0_Pin|PB1_Pin|PB2_Pin|PB3_Pin
                          |PB4_Pin|PB5_Pin|PB6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler1(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

